import React from "react";

export default function About() {
  return (
    <section className="font-sans">
      <h1 className="text-2xl font-bold text-neutral-50/80 mb-4">ABOUT</h1>
      <article>
        <p className="text-sm text-neutral-50/60">
          私の目標は、２つあります。
          <br />
          1つめは、ユーザーにとって継続的に使ってもらえる、価値を提供し続けられるサービス、
          <br />
          運用者にとって「わかりやすく、運用目線でも課題解決やシステム改善を容易にし続けられる」
          システムを作れる人材になること。
          <br />
          <br />
          ２つめは、 体調や環境により思うようにパフォーマンスをはっきできない。
          同じように悩む人を一人でも支えられるサービスや仕組みづくりを生み出すことです。
          <br />
          <br />
          現在、金融業界のシステム運用保守の業務に従事しています。
          <br />
          業務を通して、要件の理解、改修個所の調査～修正、リリースまでの一連の流れに携われること、
          <br />
          エラーやバグが発生したときに問題個所の特定⇒解消ができたときに喜びを感じています。
          <br />
          <br />
          一方で、日々の業務を通じて強く感じていることは、
          <br />
          生じる課題や問題に対して、
          <b>「環境や技術スタックのせい」「仕方がない」</b>
          で終わらせず、どうすれば運用しやすいシステムやサービスを作ることができるのか、
          <br />
          開発の過程で運用しやすいシステムを作ることはできないのかという思いが生まれました。
          <br />
          <br />
          完成したものに修正する経験はありましたが、0→1で開発するにはどうすればいいのかわからなかったため、
          <br />
          現在は、コミュニティに入会し、個人開発やアウトプット活動を日々行っています。
          <br />
          コミュニティ活動を通じて、アウトップを通して自ら価値を生み出す方法、新しい技術のキャッチアップと技術を使いこなす方法を学びました。
          <br />
          学んだことを業務を通していかせるようになりたい。
          <br />
          <br />
          ２つめは、 体調や環境により思うようにパフォーマンスをはっきできない。
          同じように悩む人を一人でも支えられるサービスや仕組みづくりを生み出すことです。
          <br />
          私自身自分の体調の症状からリモートワークとIT業界に救われました。
          <br />
        </p>
      </article>
    </section>
  );
}
